 /******************************************************************    00010000
 *                                                                *     00020000
 *                    DELETE Policy                               *     00030000
 *                                                                *     00040000
 * VSAM KSDS Policy record DELETE                                 *     00050000
 *                                                                *     00060000
 *                                                                *     00070000
 *                                                                *     00080000
 ******************************************************************/    00090000
 LGDPVS01: Proc(COMM_AREA_PTR) Options(Main);                           00100005
                                                                        00110000
                                                                        00120000
  DCL 1  WS_RESP                 FIXED BIN(31);                         00130000
  DCL 1  WS_RESP2                FIXED BIN(31);                         00140000
  DCL 1  WS_Comm_Len             FIXED BIN(31);                         00150000
  DCL 1  WS_STARTCODE            CHAR(2) INIT(' ');                     00160000
  DCL 1  WS_SYSID                CHAR(4) INIT(' ');                     00170000
  DCL 1  WS_Commarea_Len         FIXED BIN(15);                         00180000
                                                                        00190000
  DCL 1  WF_Policy_Info,                                                00200000
    03  WF_Policy_Key,                                                  00210000
      05  WF_Request_ID           CHAR(1),                              00220000
      05  WF_Customer_Num         CHAR(10),                             00230000
      05  WF_Policy_Num           CHAR(10);                             00240000
                                                                        00250000
 /* Variables for time/date processing */                               00260000
  DCL 1  WS_ABSTIME               FIXED BIN(31) INIT(+0);               00270000
  DCL 1  WS_TIME                  CHAR(8)  INIT(' ');                   00280000
  DCL 1  WS_DATE                  CHAR(10) INIT(' ');                   00290000
 /* Error Message structure */                                          00300000
  DCL 1  ERROR_MSG,                                                     00310000
      03 EM_DATE                  CHAR(10) INIT(' '),                   00320001
      03 *                        CHAR     INIT(' '),                   00330000
      03 EM_TIME                  CHAR(8)  INIT(' '),                   00340001
      03 *                        CHAR(9)  INIT(' LGDPVS01'),           00350000
      03 EM_VARIABLE,                                                   00360000
        05 EM_MSG_TEXT            CHAR(63),                             00370001
        05 *,                                                           00371001
         7 *                      CHAR(6)   INIT(' PNUM='),             00372001
         7 EM_POLNUM              CHAR(10)  INIT(' '),                  00380001
         7 *                      CHAR(6)   INIT(' CNUM='),             00390001
         7 EM_CUSNUM              CHAR(10)  INIT(' '),                  00400001
         7 *                      CHAR(21)                              00410001
                                   INIT(' Delete file KSDSPOLY'),       00420000
         7 *                      CHAR(6)   INIT(' RESP='),             00430001
         7 EM_RESPRC              PIC '+(5)9',                          00440001
         7 *                      CHAR(7)   INIT(' RESP2='),            00450001
         7 EM_RESP2RC             PIC '+(5)9';                          00460001
                                                                        00470000
  DCL 1  CA_ERROR_MSG,                                                  00480000
       3 *                        CHAR(9)  INIT('COMMAREA='),           00490000
       3 CA_DATA                  CHAR(90) INIT(' ');                   00500000
                                                                        00510000
                                                                        00520000
  DCL 1 Eyecatcher               CHAR(16)                               00530000
                                 INIT('Program LGDPVS01');              00540004
                                                                        00550000
 %INCLUDE LGCMAREA;                                                     00560003
                                                                        00570000
 /*---------------------------------------------------------------*/    00590000
  WS_Commarea_Len = EIBCALEN;                                           00600000
  WF_Request_ID   = SUBSTR(CA_Request_ID,4,1);                          00610000
  WF_Policy_Num   = CA_Policy_Num;                                      00620000
  WF_Customer_Num = CA_Customer_Num;                                    00630000
                                                                        00640000
  Exec CICS Delete File('KSDSPOLY')                                     00650000
            Ridfld(WF_Policy_Key)                                       00660000
            KeyLength(21)                                               00670000
            RESP(WS_RESP);                                              00680000
                                                                        00690000
  If (WS_RESP <> DFHRESP(NORMAL)) THEN DO;                              00700000
    WS_RESP2 = EIBRESP2;                                                00710000
    CA_RETURN_CODE = '81';                                              00720000
    CALL WRITE_ERROR_MESSAGE;                                           00730000
    EXEC CICS RETURN;                                                   00740000
  End;                                                                  00750000
                                                                        00760000
 RETURN;                                                                00770000
                                                                        00780000
 /*-------------------------------------------------------------------*/00790000
 WRITE_ERROR_MESSAGE: PROCEDURE;                                        00800000
  EXEC CICS ASKTIME ABSTIME(WS_ABSTIME);                                00810000
                                                                        00820000
  EXEC CICS FORMATTIME ABSTIME(WS_ABSTIME)                              00830000
            MMDDYYYY(WS_DATE)                                           00840000
            TIME(WS_TIME);                                              00850000
                                                                        00870000
  EM_DATE = WS_DATE;                                                    00880000
  EM_TIME = WS_TIME;                                                    00890000
  EM_Cusnum = CA_Customer_Num;                                          00900000
  EM_RespRC = WS_RESP;                                                  00910000
  EM_Resp2RC = WS_RESP2;                                                00920000
  EXEC CICS LINK PROGRAM('LGSTSQ')                                      00930000
            COMMAREA(ERROR_MSG)                                         00940000
            LENGTH(STG(ERROR_MSG));                                     00950001
                                                                        00960000
  IF (EIBCALEN > 0) THEN DO;                                            00970000
    IF (EIBCALEN < 91) THEN DO;                                         00980000
      CA_DATA = LEFT(COMM_AREA_RAW,EIBCALEN);                           00990000
      EXEC CICS LINK PROGRAM('LGSTSQ')                                  01000000
                COMMAREA(CA_ERROR_MSG)                                  01010000
                LENGTH(STG(ERROR_MSG));                                 01020001
    END;                                                                01030000
    ELSE DO;                                                            01040000
      CA_DATA = LEFT(COMM_AREA_RAW,90);                                 01050000
      EXEC CICS LINK PROGRAM('LGSTSQ')                                  01060000
                COMMAREA(CA_ERROR_MSG)                                  01070000
                LENGTH(STG(ERROR_MSG));                                 01080001
    END;                                                                01090000
  END;                                                                  01100000
 RETURN;                                                                01110000
 END WRITE_ERROR_MESSAGE;                                               01120000
                                                                        01130000
 END LGDPVS01;                                                          01150004