 /*********************************************************************/00010000
 /*                                                                   */00020000
 /*                    Inquire Policy                                 */00030000
 /*  Business logic for policy inquire                                */00040000
 /*   To obtain full details of an individual policy:                 */00050000
 /*     Endowment, House or Motor                                     */00060000
 /*                                                                   */00070000
 /*********************************************************************/00080000
 /* LGIPOL01: Proc(DFHEIPTR,COMM_AREA_PTR) Options(Main); */            00090006
 LGIPOL01: Proc(COMM_AREA_PTR) Options(Main);                           00091006
                                                                        00100000
 /*-------------------------------------------------------------------*/00110000
 /* Common defintions                                                 */00120000
 /*-------------------------------------------------------------------*/00130000
 /* Run time (debug) infomation for this invocation */                  00140000
 DCL 1 WS_HEADER,                                                       00150000
       3 WS_EYECATCHER        CHAR(16) INIT('LGIPOL01------WS'),        00160009
       3 WS_TRANSID           CHAR(4) INIT(''),                         00170000
       3 WS_TERMID            CHAR(4) INIT(''),                         00180000
       3 WS_TASKNUM           PIC '(7)9' INIT(0),                       00190000
       3 WS_FILLER            CHAR INIT(''),                            00200000
       3 WS_ADDR_DFHCOMMAREA  PTR INIT(SYSNULL()),                      00210000
       3 WS_CALEN             FIXED BIN(15) INIT(0);                    00220000
                                                                        00230000
 /* Variables for time/date processing */                               00240000
 DCL 1 ABS_TIME               FIXED DEC(15) INIT(0);                    00250000
 DCL 1 TIME1                  CHAR(8) INIT('');                         00260000
 DCL 1 DATE1                  CHAR(10) INIT('');                        00270000
                                                                        00280000
 /* Error Message structure */                                          00290000
 DCL 1 ERROR_MSG,                                                       00300000
       3 EM_DATE              CHAR(10) INIT(''),                        00310000
       3 *                    CHAR INIT(''),                            00320000
       3 EM_TIME              CHAR(8) INIT(''),                         00330000
       3 *                    CHAR(9) INIT(' LGIPOL01'),                00340000
       3 EM_VARIABLE UNION,                                             00350000
         5 EM_MSG_TEXT        CHAR(63),                                 00360000
         5 *,                                                           00370000
           7 *                  CHAR(6) INIT(' CNUM='),                 00380000
           7 EM_CUSNUM          CHAR(10) INIT(''),                      00390000
           7 *                  CHAR(6) INIT(' PNUM='),                 00400000
           7 EM_POLNUM          CHAR(10) INIT(''),                      00410000
           7 EM_SQLREQ          CHAR(16) INIT(''),                      00420000
           7 *                  CHAR(9) INIT(' SQLCODE='),              00430000
           7 EM_SQLRC           PIC '+(5)9';                            00440000
                                                                        00450000
 DCL 1 CA_ERROR_MSG,                                                    00460000
       3 *                    CHAR(9) INIT('COMMAREA='),                00470000
       3 CA_DATA              CHAR(90)  INIT('');                       00480000
 /*-------------------------------------------------------------------*/00490000
 DCL 1 MINUS_ONE              FIXED BIN(15) STATIC INIT(-1);            00500000
                                                                        00510000
 DCL 1 WS_COMMAREA_LENGTHS,                                             00520000
       3 WS_CA_HEADERTRAILER_LEN  FIXED BIN(15) INIT(33),               00530000
       3 WS_REQUIRED_CA_LEN       PIC 'S(4)9' INIT(0);                  00540000
                                                                        00550000
 DCL 1 END_POLICY_POS             FIXED BIN(15) INIT(1);                00560000
 DCL 1 LGIPDB01                   CHAR(8) INIT('LGIPDB01');             00570000
 /*-------------------------------------------------------------------*/00580000
 %INCLUDE LGPOLICY;                                                     00590002
                                                                        00600000
 DCL IND_BROKERID                FIXED BIN(15);                         00610000
 DCL IND_BROKERSREF              FIXED BIN(15);                         00620000
 DCL IND_PAYMENT                 FIXED BIN(15);                         00630000
 DCL IND_E_PADDINGDATA           FIXED BIN(15);                         00640000
 DCL IND_E_PADDINGDATAL          FIXED BIN(15);                         00650000
 /*-------------------------------------------------------------------*/00660000
 %INCLUDE LGCMAREA;                                                     00670002
 /*********************************************************************/00680000
 /*    P R O C E D U R E S                                            */00690000
 /*********************************************************************/00700000
 WS_TRANSID = EIBTRNID;                                                 00710000
 WS_TERMID = EIBTRMID;                                                  00720000
 WS_TASKNUM = EIBTASKN;                                                 00730000
                                                                        00740000
 /* If NO commarea received issue an ABEND */                           00750000
 IF EIBCALEN = 0 THEN DO;                                               00760000
    EM_MSG_TEXT = ' NO COMMAREA RECEIVED';                              00770000
    CALL WRITE_ERROR_MESSAGE;                                           00780000
    EXEC CICS ABEND ABCODE('LGCA') NODUMP;                              00790000
 END;                                                                   00800000
                                                                        00810000
 /* initialize commarea return code to zero */                          00820000
 CA_RETURN_CODE = '00';                                                 00830000
 WS_CALEN = EIBCALEN;                                                   00840000
 WS_ADDR_DFHCOMMAREA = COMM_AREA_PTR;                                   00850000
                                                                        00860000
 EM_CUSNUM = CA_CUSTOMER_NUM;                                           00870000
 EM_POLNUM = CA_POLICY_NUM;                                             00890000
                                                                        00900000
 EXEC CICS LINK Program(LGIPDB01)                                       00910000
           Commarea(COMM_AREA)                                          00920000
           Length(32000);                                               00930000
                                                                        00940000
                                                                        01000000
 IF CA_M_MAKE = 'HONDA' THEN                                            01010000
    CA_EXPIRY_DATE = '2099-01-01';                                      01020000
                                                                        01030000
 EXEC CICS RETURN;                                                      01040000
                                                                        01050000
 RETURN;                                                                01060000
 /*-------------------------------------------------------------------*/01070000
                                                                        01080000
 /*===================================================================*/01090000
 /* Procedure to write error message to Queues                        */01100000
 /*   message will include Date, Time, Program Name, Customer         */01110000
 /*   Number, Policy Number and SQLCODE.                              */01120000
 /*===================================================================*/01130000
 WRITE_ERROR_MESSAGE: PROC;                                             01140000
 /* Save SQLCODE in message */                                          01150000
 /* Obtain and format current time and date */                          01160000
 EXEC CICS ASKTIME ABSTIME(ABS_TIME);                                   01170000
 EXEC CICS FORMATTIME ABSTIME(ABS_TIME)                                 01180000
           MMDDYYYY(DATE1)                                              01190000
           TIME(TIME1);                                                 01200000
 EM_DATE = DATE1;                                                       01210000
 EM_TIME = TIME1;                                                       01220000
 /* Write output message to TDQ */                                      01230000
 EXEC CICS LINK PROGRAM('LGSTSQ')                                       01240000
           COMMAREA(ERROR_MSG)                                          01250000
           LENGTH(STG(ERROR_MSG));                                      01260000
 /* Write 90 bytes or as much as we have of commarea to TDQ */          01270000
 IF EIBCALEN > 0 THEN DO;                                               01280000
    IF EIBCALEN < 91 THEN DO;                                           01290000
       CA_DATA = LEFT(COMM_AREA_RAW,EIBCALEN);                          01300008
       EXEC CICS LINK PROGRAM('LGSTSQ')                                 01310000
                 COMMAREA(CA_ERROR_MSG)                                 01320000
                 LENGTH(STG(CA_ERROR_MSG));                             01330000
    END;                                                                01340000
    ELSE DO;                                                            01350000
       CA_DATA = LEFT(COMM_AREA_RAW,90);                                01360008
       EXEC CICS LINK PROGRAM('LGSTSQ')                                 01370000
                 COMMAREA(CA_ERROR_MSG)                                 01380000
                 LENGTH(STG(CA_ERROR_MSG));                             01390000
    END;                                                                01400000
 END;                                                                   01410000
 RETURN;                                                                01420000
 END WRITE_ERROR_MESSAGE;                                               01430000
 END LGIPOL01;                                                          01440003