DEFINE PROGRAM(LGACDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGACDB02) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGACUS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGACVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGAPBR01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGAPDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGAPOL01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGAPVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGDPDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGDPOL01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGDPVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGICDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGICUS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGICVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGIPDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGIPOL01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGIPVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGSETUP) GROUP(GENASAP)                                          
       DESCRIPTION(Initial setup of TSQueue)                                           
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:37)              
       CHANGETIME(20/08/11 12:43:37) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGSTSQ) GROUP(GENASAP)                                           
       DESCRIPTION(Message output to TSQueues)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:37)              
       CHANGETIME(20/08/11 12:43:37) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGTESTC1) GROUP(GENASAP)                                         
       DESCRIPTION(Solution Customer Menu)                                             
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGTESTP1) GROUP(GENASAP)                                         
       DESCRIPTION(Solution Motor Policy Menu)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGTESTP2) GROUP(GENASAP)                                         
       DESCRIPTION(Solution Life Policy Menu)                                          
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGTESTP3) GROUP(GENASAP)                                         
       DESCRIPTION(Solution House Policy Menu)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGTESTP4) GROUP(GENASAP)                                         
       DESCRIPTION(Solution Commercial Policy Menu)                                    
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGUCDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGUCUS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGUCVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGUPDB01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGUPOL01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(LGUPVS01) GROUP(GENASAP)                                         
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:37)              
       CHANGETIME(20/08/11 12:43:37) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)                                  
DEFINE PROGRAM(SSMAP) GROUP(GENASAP)                                            
       DESCRIPTION(BMS Map)                                                            
       LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)                    
       USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(ANY)               
       EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)            
       EXECUTIONSET(FULLAPI) JVM(NO) DEFINETIME(20/08/11 12:43:36)              
       CHANGETIME(20/08/11 12:43:36) CHANGEUSRID(SYSADM)                        
       CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)  
DEFINE TRANSACTION(LGCF) GROUP(GENASAT)                                         
       PROGRAM(LGICVS01) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(LGPF) GROUP(GENASAT)                                         
       PROGRAM(LGIPVS01) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(LGSE) GROUP(GENASAT)                                         
       PROGRAM(LGSETUP) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)            
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(SSC1) GROUP(GENASAT)                                         
       PROGRAM(LGTESTC1) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(SSP1) GROUP(GENASAT)                                         
       PROGRAM(LGTESTP1) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(SSP2) GROUP(GENASAT)                                         
       PROGRAM(LGTESTP2) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(SSP3) GROUP(GENASAT)                                         
       PROGRAM(LGTESTP3) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
DEFINE TRANSACTION(SSP4) GROUP(GENASAT)                                         
       PROGRAM(LGTESTP4) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)           
       TASKDATALOC(ANY) TASKDATAKEY(USER) STORAGECLEAR(NO)                      
       RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)              
       ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(NO)                 
       RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)                 
       CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)                    
       WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)                                    
       DEFINETIME(20/08/11 12:43:36) CHANGETIME(20/08/11 12:43:36)              
       CHANGEUSRID(SYSADM) CHANGEAGENT(CSDBATCH) CHANGEAGREL(0720)              
                                
